Dlubal.TimberPro.LateralTorsionalBucklingOption
Option of effective length or critical bending moment for lateral-torsional buckling Lcr / Mcr

Dlubal.TimberPro.LateralTorsionalBucklingOption.LateralTorsionalBucklingOptionUnknown
Unknown

Dlubal.TimberPro.LateralTorsionalBucklingOption.LateralTorsionalBucklingOptionEffectiveLengthManually
Effective length for lateral-torsional buckling sets manually

Dlubal.TimberPro.LateralTorsionalBucklingOption.LateralTorsionalBucklingOptionCriticalBendingMomentManually
Critical bending moment for lateral-torsional buckling sets manually

Dlubal.TimberPro.LateralTorsionalBucklingOption.LateralTorsionalBucklingOptionAsMemberLength
Effective length for lateral-torsional buckling sets as member length

Dlubal.TimberPro.LateralTorsionalBucklingOption.LateralTorsionalBucklingOptionAccordingTable61
Effective length for lateral-torsional buckling sets according Table 6.1